src/Catalogs/ТехнологическиеЖурналы/ТехнологическиеЖурналы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТехнологическиеЖурналы</name>
  <attributes>
    <name>КаталогНастройкиТЖ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КаталогЛогов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГУИД</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>Настройка</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Отключен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочийСервер</name>
    <type>
      <types>CatalogRef.Оборудование</types>
    </type>
  </attributes>
  <attributes>
    <name>КаталогЛоговСетевой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроизвольныйТекстНастройки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВнешниеЦКК</name>
    <attributes>
      <name>ПередаватьДанные</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВнешнийЦКК</name>
      <type>
        <types>CatalogRef.ВнешниеЦКК</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШаблоныТЖ</name>
    <attributes>
      <name>ШаблонТЖВыбранный</name>
      <type>
        <types>CatalogRef.ТехнологическиеЖурналыШаблоны</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстШаблона</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/InformationRegisters/ПараметрыРабочихСерверов/ПараметрыРабочихСерверов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПараметрыРабочихСерверов</name>
  <resources>
    <name>Кластер</name>
    <type>
      <types>CatalogRef.ОбъектыКонтроля</types>
    </type>
  </resources>
  <resources>
    <name>КаталогНастроекТЖ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КаталогНастроекТЖСетевой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КаталогОбменаДанными</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КаталогОбменаДаннымиСетевой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КаталогВременный</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Оборудование</name>
    <type>
      <types>CatalogRef.Оборудование</types>
    </type>
  </resources>
  <resources>
    <name>ДиапазонПортовОт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДиапазонПортовДо</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДиапазоныПортов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОписаниеСервера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>IPПорт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МаксимальныйОбъемПамятиРабочихПроцессов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>БезопасныйРасходПамятиЗаОдинВызов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОбъемПамятиРабочихПроцессовДоКоторогоСерверСчитаетсяПроизводительным</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоИбНаПроцесс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоСоединенийНаПроцесс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПортГлавногоМенеджераКластера</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МенеджерНаКаждыйСервис</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЦентральныйСервер</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ОбъектКонтроля</name>
    <type>
      <types>CatalogRef.ВидыОбъектовКонтроля</types>
      <types>CatalogRef.ОбъектыКонтроля</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/НастройкиСборДампов/НастройкиСборДампов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиСборДампов</name>
  <resources>
    <name>КаталогТЖСетевой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КаталогТЖЛокальный</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДлительностьХраненияФайловТЖ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КаталогВыгрузкиДамповСетевой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КаталогВыгрузкиДампов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КаталогВременныхФайлов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УровеньДетализацииДампов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>АвтоматическаяНастройка</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьАгента</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Расписание</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <dimensions>
    <name>КонтрольнаяПроцедура</name>
    <type>
      <types>CatalogRef.КонтрольныеПроцедуры</types>
      <types>CatalogRef.ВидыКонтрольныхПроцедур</types>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/БезопасноеХранилище/БезопасноеХранилище.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>БезопасноеХранилище</name>
  <resources>
    <name>ДанныеХранилища</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <dimensions>
    <name>ВладелецХранилища</name>
    <type>
      <types>CatalogRef.НастройкиАнализаПроблемПроизводительности</types>
      <types>CatalogRef.КонтрольныеПроцедуры</types>
      <types>CatalogRef.Публикации</types>
      <types>CatalogRef.ВидыКонтрольныхПроцедур</types>
      <types>CatalogRef.ВидыОбъектовКонтроля</types>
      <types>String</types>
      <types>CatalogRef.ОбъектыКонтроля</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/КонтрольныеПроцедуры/КонтрольныеПроцедуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КонтрольныеПроцедуры</name>
  <owners>Catalog.ВидыКонтрольныхПроцедур</owners>
  <attributes>
    <name>Выполнять</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КлючРегламентногоЗадания</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектКонтроля</name>
    <type>
      <types>CatalogRef.ОбъектыКонтроля</types>
    </type>
  </attributes>
  <attributes>
    <name>Расписание</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкаВыполнена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Пауза</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДеактивацияТолькоСлужебныхЗадачПриОтключении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеИзменилось</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Сохранено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОповещатьОСбое</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОповещатьОВосстановлении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздаватьИнцидент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АвтоЗакрытиеИнцидента</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительноеОповещение</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПараметрыОповещенияПриСбое</name>
    <attributes>
      <name>Оповещать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПериодОповещения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/ТехнологическиеЖурналы/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Функция ПолучитьНаименованиеНовогоЭлемента() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(ТехнологическиеЖурналы.Ссылка) КАК КоличествоЭлементов
	|ИЗ
	|	Справочник.ТехнологическиеЖурналы КАК ТехнологическиеЖурналы
	|";
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат "Настройка 1";
	Иначе
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		Возврат "Настройка " + Формат(Выборка.КоличествоЭлементов + 1, "ЧГ=0");
	КонецЕсли;
КонецФункции

Функция ПолучитьУИД_ТЖ(Ссылка) Экспорт
	Возврат "<!--Настройки ЦКК: " + Ссылка.УникальныйИдентификатор();
КонецФункции

Функция УдалитьСвоиСекции(ТекстНастройки, УИД_ТЖ) Экспорт
	ТекстНастройкиБыл = ТекстНастройки;
	
	ИндексУИД = СтрНайти(ТекстНастройкиБыл, УИД_ТЖ);
	Если ИндексУИД > 0 Тогда
		ТекстНастройкиЧистый = Лев(ТекстНастройкиБыл, ИндексУИД - 1);
		ТекстНастройкиБыл = Сред(ТекстНастройкиБыл, ИндексУИД + СтрДлина(УИД_ТЖ));
		
		ИндексУИД = СтрНайти(ТекстНастройкиБыл, УИД_ТЖ);
		Если ИндексУИД > 0 Тогда
			ТекстНастройкиЧистый = ТекстНастройкиЧистый + Сред(ТекстНастройкиБыл, ИндексУИД + СтрДлина(УИД_ТЖ + "-->"));
		КонецЕсли;
	Иначе
		ТекстНастройкиЧистый = ТекстНастройкиБыл;
	КонецЕсли;
	
	Возврат ТекстНастройкиЧистый;
КонецФункции

Функция УдалитьСекциюDUMP(ТекстНастройки) Экспорт
	ТекстНастройкиБыл = ТекстНастройки;
	
	Индекс = СтрНайти(ТекстНастройкиБыл, "<dump");
	Если Индекс > 0 Тогда
		ТекстНастройкиЧистый = Лев(ТекстНастройкиБыл, Индекс - 1);
		ТекстНастройкиБыл = Сред(ТекстНастройкиБыл, Индекс + СтрДлина("<dump"));
		
		Индекс = СтрНайти(ТекстНастройкиБыл, "/>");
		Если Индекс > 0 Тогда
			ТекстНастройкиЧистый = ТекстНастройкиЧистый + Сред(ТекстНастройкиБыл, Индекс + СтрДлина("/>"));
		Иначе
			ТекстНастройкиЧистый = ТекстНастройкиЧистый + ТекстНастройкиБыл;
		КонецЕсли;
	Иначе
		ТекстНастройкиЧистый = ТекстНастройкиБыл;
	КонецЕсли;
	
	Возврат ТекстНастройкиЧистый; 
КонецФункции

Функция ПолучитьПроцедурыКонтроляУстойчивости(Ссылка) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	СпрКП.Выполнять КАК Выполнять,
	|	СпрТЖ.Ссылка КАК ТехнологическийЖурнал,
	|	СпрКП.Ссылка КАК КонтрольнаяПроцедура,
	|	РегПараметрыРС.ОбъектКонтроля,
	|	ISNULL(РегПараметрыРС.КаталогНастроекТЖСетевой, СпрТЖ.КаталогНастройкиТЖ) КАК КаталогНастройкиТЖ,
	|	ISNULL(РегНастройкиСД.КаталогВыгрузкиДамповСетевой, СпрТЖ.КаталогЛоговСетевой) КАК КаталогВыгрузкиДамповСетевой,
	|	ISNULL(РегНастройкиСД.КаталогВыгрузкиДампов, СпрТЖ.КаталогЛогов) КАК КаталогВыгрузкиДампов,
	|	"""" КАК КаталогЭкспортаДампов,
	|	РегНастройкиСД.КаталогВременныхФайлов
	|ИЗ
	|	Справочник.ТехнологическиеЖурналы КАК СпрТЖ
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.ПараметрыРабочихСерверов КАК РегПараметрыРС
	|ПО
	|	СпрТЖ.РабочийСервер = РегПараметрыРС.Оборудование
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	Справочник.КонтрольныеПроцедуры КАК СпрКП
	|ПО
	|	СпрКП.ОбъектКонтроля = РегПараметрыРС.ОбъектКонтроля
	|	И СпрКП.Владелец = &ВидКонтрольнойПроцедуры
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.НастройкиСборДампов КАК РегНастройкиСД
	|ПО
	|	РегНастройкиСД.КонтрольнаяПроцедура = СпрКП.Ссылка
	|ГДЕ
	|	СпрТЖ.Ссылка В (&ТЖ)
	|";
	Запрос.УстановитьПараметр("ТЖ", Ссылка);
	Запрос.УстановитьПараметр("ВидКонтрольнойПроцедуры", Справочники.ВидыКонтрольныхПроцедур.КонтрольУстойчивостиСистемы());
	
	Результат = Запрос.Выполнить();
	
	Данные = Общий.РезультатЗапросаВМассив(Результат);
	
	УстановитьПривилегированныйРежим(Истина);
	Для Каждого ТекДанные Из Данные Цикл
		ДанныеХранилища = РегистрыСведений.БезопасноеХранилище.ПолучитьДанные(ТекДанные.КонтрольнаяПроцедура);
		Если ДанныеХранилища = Неопределено Тогда
			ДанныеХранилища = Новый Структура("КаталогЭкспортаДампов", "");
		КонецЕсли;
		ТекДанные.КаталогЭкспортаДампов = ДанныеХранилища.КаталогЭкспортаДампов;
	КонецЦикла;
	УстановитьПривилегированныйРежим(Ложь);
			
	Возврат Данные;
КонецФункции

Функция ПолучитьТехнологическиеЖурналыШаблона(ШаблонСсылка) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТехнологическиеЖурналыШаблоныТЖ.Ссылка КАК ТехнологическийЖурнал
	|ИЗ
	|	Справочник.ТехнологическиеЖурналы.ШаблоныТЖ КАК ТехнологическиеЖурналыШаблоныТЖ
	|ГДЕ
	|	ТехнологическиеЖурналыШаблоныТЖ.ШаблонТЖВыбранный = &ШаблонСсылка
	|";
	
	Запрос.УстановитьПараметр("ШаблонСсылка", ШаблонСсылка);
	Результат = Запрос.Выполнить();
	
	Данные = Общий.РезультатЗапросаВМассив(Результат);
	
	Возврат Данные;
КонецФункции

#КонецЕсли
